tests/performance/seckill/sustained-load.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Sustained Load" enabled="true"><stringProp name="TestPlan.comments">Run this plan once per pressure level; users loop during the duration.</stringProp><boolProp name="TestPlan.functional_mode">false</boolProp><boolProp name="TestPlan.serialize_threadgroups">false</boolProp><elementProp name="TestPlan.user_defined_variables" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp></TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Sustained Users" enabled="true"><stringProp name="ThreadGroup.num_threads">${__P(threads,100)}</stringProp><stringProp name="ThreadGroup.ramp_time">${__P(ramp_seconds,60)}</stringProp><boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp><stringProp name="ThreadGroup.on_sample_error">continue</stringProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController"><boolProp name="LoopController.continue_forever">true</boolProp><stringProp name="LoopController.loops">-1</stringProp></elementProp><boolProp name="ThreadGroup.scheduler">true</boolProp><stringProp name="ThreadGroup.duration">${__P(duration_seconds,300)}</stringProp><stringProp name="ThreadGroup.delay">0</stringProp></ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Headers" enabled="true"><collectionProp name="HeaderManager.headers"><elementProp name="Content-Type" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp><elementProp name="Authorization" elementType="Header"><stringProp name="Header.name">Authorization</stringProp><stringProp name="Header.value">Bearer ${__P(auth_token,)}</stringProp></elementProp></collectionProp></HeaderManager><hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestGui" testclass="HTTPSamplerProxy" testname="Create Order" enabled="true"><stringProp name="HTTPSampler.domain">${__P(core_host,127.0.0.1)}</stringProp><stringProp name="HTTPSampler.port">${__P(core_port,8080)}</stringProp><stringProp name="HTTPSampler.protocol">${__P(core_protocol,http)}</stringProp><stringProp name="HTTPSampler.path">/api/v1/store/orders</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><boolProp name="HTTPSampler.auto_redirects">false</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp><boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp><stringProp name="HTTPSampler.implementation">HttpClient4</stringProp><boolProp name="HTTPSampler.postBodyRaw">true</boolProp><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{&quot;productId&quot;:${__P(product_id,1)},&quot;userCouponId&quot;:null}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp></HTTPSamplerProxy><hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>